app/controllers/highscores_controller.rb

  def index
    if params[:name] && !params[:name].empty?
      @highscores = Highscore.find_all_by_name(params[:name])
---
SELECT * FROM "highscores" WHERE ("highscores"."name" = 'Emma')

  def create
    @highscore = Highscore.new(params[:highscore])

    if @highscore.save
---
INSERT INTO "highscores" ("name", "created_at", "updated_at", "score") VALUES('Fredrik', '2011-02-27 03:05:08', '2011-02-27 03:05:08', 1032)