app/controllers/words_controller.rb

SELECT * FROM "words" WHERE ("words"."kind" = '0') ORDER BY random() LIMIT 10
---
  def show
    if params[:id] == "2"
      @words = Word.all(:order => 'random()', :conditions => {:kind => 0}, :limit => 5)